XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F1xx_DFP.pdsc
          <!--book name="Documents/CD00191185.pdf" title="FT32F103xC FT32F103xD FT32F103xE Data Sheet"/-->
          <feature type="IOs"           n="51"/>
          <feature type="LQFP"           n="64"/>
        </device>
       
	  </subFamily>
	  <!-- ************************  Subfamily 'FT32F113'  **************************** -->
      <subFamily DsubFamily="FT32F113">

        <debugvars configfile="Debug/FT32F101_102_103_105_107.dbgconf" version="1.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
        </debugvars>

        <!--book name="Documents/CD00171190.pdf" title="FT32F103xx Reference Manual"/-->
        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="VCC"           n="2.00"    m="5.50"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="USBD"          n="1"/>
        <feature type="I2C"           n="2"/>
		<feature type="ADC"           n="16"      m="12"/>
		<feature type="SPI"           n="2"       m="18000000"/>
		<feature type="USART"         n="3"       m="4500000"/>
        <feature type="Timer"         n="4"       m="16"/>
        <!-- *************************  Device 'FT32F113VB'  ***************************** -->
        <device Dname="FT32F113VB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="LQFP"           n="100"/>
        </device>

        <!-- *************************  Device 'FT32F113RB'  ***************************** -->
        <device Dname="FT32F113RB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->  
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LQFP"           n="64"/>
        </device>

        <!-- *************************  Device 'FT32F113CB'  ***************************** -->
        <device Dname="FT32F113CB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->  
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LQFP"          n="48"/>
        </device>
        <!-- *************************  Device 'FT32F113V8'  ***************************** -->
        <device Dname="FT32F113V8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->  
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="LQFP"          n="100"/>
        </device>
        <!-- *************************  Device 'FT32F113R8'  ***************************** -->
        <device Dname="FT32F113R8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->  
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LQFP"          n="64"/>
        </device>
        <!-- *************************  Device 'FT32F113C8'  ***************************** -->
        <device Dname="FT32F113C8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/FT32F10x.h"  define="FT32F11X_MD"/>
          <debug svd="SVD/FT32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/FT32F11x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/CD00161566.pdf" title="FT32F103x8 FT32F103xB Data Sheet"/-->  
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LQFP"          n="48"/>
        </device>
       
	  </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions selecting Compiler -->
    <condition id="Compiler ARM">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="FT32F1xx">
      <description>FremontMicro FT32F1xx Device</description>
      <require Dvendor="FMD:169" Dname="FT32F1*"/>
    </condition>
    <condition id="FT32F1xx MD">
      <description>FremontMicro FT32F1xx Mid Density Device</description>
      <require Dvendor="FMD:169" Dname="FT32F1*3?[8B]"/>
    </condition>
