XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F1xx_DFP.pdsc
    <condition id="FT32F1xx HD">
      <description>FremontMicro FT32F1xx High Density Device</description>
      <require Dvendor="FMD:169" Dname="FT32F103?[CDE]"/>
    </condition>

    <condition id="FT32F1xx MD ARMCC">
      <description>filter for FT32F1xx Mid Density Device and the ARM compiler</description>
      <require condition="FT32F1xx MD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="FT32F1xx HD ARMCC">
      <description>filter for FT32F1xx High Density Device and the ARM compiler</description>
      <require condition="FT32F1xx HD"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="FT32F1xx CMSIS">
      <description>FremontMicro FT32F1xx Device with CMSIS</description>
      <require condition="FT32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="FT32F1xx CMSIS GPIO">
      <description>FremontMicro FT32F1xx Device with CMSIS and GPIO</description>
      <require condition="FT32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>
   
    <condition id="FT32F1xx CMSIS GPIO DMA">
      <description>FremontMicro FT32F1xx Device with CMSIS, GPIO and DMA</description>
      <require condition="FT32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
      <require Cclass="Device" Cgroup="DMA" />
    </condition>

    <condition id="FT32F1xx CMSIS GPIO SPI">
      <description>FremontMicro FT32F1xx Device with CMSIS, GPIO and SPI Driver</description>
      <require condition="FT32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" />
    </condition>

    <condition id="FT32F1xx CMSIS RTOS I2C">
      <description>FremontMicro FT32F1xx Device with CMSIS, RTOS and I2C Driver</description>
      <require condition="FT32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" />
    </condition>

    <condition id="FT32F1xx STDPERIPH">
      <description>FremontMicro FT32F1xx with Standard Peripherals Drivers Framework</description>
      <require condition="FT32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
    </condition>
    <condition id="FT32F1xx STDPERIPH RCC">
      <description>FremontMicro FT32F1xx with Standard Peripherals Drivers Framework and RCC</description>
      <require condition="FT32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="FT32F1xx CMSIS">
      <description>System Startup for FremontMicro FT32F1xx device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>

        <!-- startup files -->
        <!--file category="source" name="Device/Source/ARM/startup_FT32F10x_ld_vl.s" attr="config" version="1.0.1" condition="FT32F1xx VL LD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_md_vl.s" attr="config" version="1.0.1" condition="FT32F1xx VL MD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_hd_vl.s" attr="config" version="1.0.1" condition="FT32F1xx VL HD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_ld.s"    attr="config" version="1.0.1" condition="FT32F1xx LD ARMCC"/-->
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_md.s"    attr="config" version="1.0.1" condition="FT32F1xx MD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_hd.s"    attr="config" version="1.0.1" condition="FT32F1xx HD ARMCC"/>
        <!--file category="source" name="Device/Source/ARM/startup_FT32F10x_xl.s"    attr="config" version="1.0.1" condition="FT32F1xx XL ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_FT32F10x_cl.s"    attr="config" version="1.0.1" condition="FT32F1xx CL ARMCC"/-->

        <!-- system file -->
        <file category="source" name="Device/Source/system_FT32F10x.c"            attr="config" version="1.0.0" />
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver/Config/RTE_Device.h"              attr="config" version="1.1.0"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/FT32F1xx_OPT.s"           attr="template" select="Flash Option Bytes Template" condition="Compiler ARM"/>
      </files>
    </component>

    <!-- START: FremontMicro Standard Peripherals Drivers -->
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>Standard Peripherals Drivers Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="Device/StdPeriph_Driver/FT32F10x_stdperiph_lib_um.chm"/>
        <file category="include" name="Device/StdPeriph_Driver/inc/"/>
        <file category="header"  name="Device/StdPeriph_Driver/inc/misc.h"/>
        <file category="source"  name="Device/StdPeriph_Driver/src/misc.c"/>
        <file category="source"  name="Device/StdPeriph_Driver/templates/FT32F10x_conf.h" attr="config" version="3.6.0"/>
        <file category="header"  name="Device/StdPeriph_Driver/templates/FT32F10x_it.h"   attr="template" select="Interrupt Service Routines"/>
        <file category="source"  name="Device/StdPeriph_Driver/templates/FT32F10x_it.c"   attr="template" select="Interrupt Service Routines"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Analog-to-digital converter (ADC) driver for FT32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_adc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_adc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>Backup registers (BKP) driver for FT32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_bkp.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_bkp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Controller area network (CAN) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_can.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_can.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CEC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Consumer electronics control controller (CEC) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CEC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_cec.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_cec.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH ">
      <description>CRC calculation unit (CRC) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_crc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Digital-to-analog converter (DAC) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_dac.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_dac.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU"    Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>MCU debug component (DBGMCU) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBGMCU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_dbgmcu.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_dbgmcu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>DMA controller (DMA) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_dma.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>External interrupt/event controller (EXTI) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_exti.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Flash"     Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>Embedded Flash memory driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_flash.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_flash.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FSMC"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Flexible Static Memory Controller (FSMC) driver for FT32F11x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FSMC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_fsmc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_fsmc.c"/>
      </files>
    </component>
