XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F1xx_DFP.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>General-purpose I/O (GPIO) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_gpio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_i2c.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH ">
      <description>Independent watchdog (IWDG) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_iwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Power controller (PWR) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_pwr.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_pwr.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>Reset and clock control (RCC) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_rcc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_rcc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH">
      <description>Real-time clock (RTC) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_rtc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Secure digital (SDIO) interface driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_sdio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_sdio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_spi.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM"       Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Timers (TIM) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_tim.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_tim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART"     Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_usart.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG"      Cversion="1.0.0" condition="FT32F1xx STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for FT32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/FT32F10x_wwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/FT32F10x_wwdg.c"/>
      </files>
    </component>
    <!-- END: FremontMicro Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0" condition="FT32F1xx CMSIS">
      <description>GPIO driver used by RTE Drivers for FT32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_FT32F10x.h"/>
        <file category="source" name="RTE_Driver/GPIO_FT32F10x.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="DMA"  Cversion="1.0" condition="FT32F1xx CMSIS">
      <description>DMA driver used by RTE Drivers for FT32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/DMA_FT32F10x.h"/>
        <file category="source" name="RTE_Driver/DMA_FT32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="CAN"          Capiversion="1.0" Cversion="1.0" condition="FT32F1xx CMSIS GPIO">
      <description>CAN Driver for FT32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_FT32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"          Capiversion="1.0" Cversion="1.0" condition="FT32F1xx CMSIS GPIO DMA">
      <description>SPI Driver for FT32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_FT32F10x.c"/>
      </files>
    </component>
