XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F1xx_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USART"        Capiversion="1.0" Cversion="1.0" condition="FT32F1xx CMSIS GPIO DMA">
      <description>UART Driver for FT32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver UART4  */
        #define RTE_Drivers_USART5              /* Driver UART5  */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_FT32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C"          Capiversion="1.0" Cversion="1.0" condition="FT32F1xx CMSIS GPIO DMA">
      <description>I2C Driver for FT32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_FT32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI"          Capiversion="1.0" Cversion="1.0" condition="FT32F1xx CMSIS GPIO DMA">
      <description>MCI Driver for FT32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_FT32F10x.c"/>
      </files>
    </component>
   
  </components>

</package>
